#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=518d2b72-db37-4eec-988d-b152e0d0d7a6]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=113ae672-7094-4d95-95a0-cf4011434621]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=55ebdfbe-0d2d-4e25-b67d-6ddfca304424]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6718c50a-5b43-48a1-a308-2bbb573dd8d2]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=551827fd-fea0-406b-a02e-4f3f4488300e]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=79e57f21-9dfa-482a-a3ba-54a9deee38dd]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2e997cac-72fb-4b7a-a2da-8cb5bb012254]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=45d40881-2d3a-4a1b-95a9-77082e21aca4]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ba407409-b523-416b-b6a0-8d0352d596c9]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0d79542e-a556-4268-b2de-efb3ebeee884]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d5da378b-e48d-4ab1-a388-34f453dda53c]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8bc4b3fa-b5ae-4522-b40b-716283547e38]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c1f3ccfa-0f38-4f64-bbb6-181890ca3330]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e88ab05a-bfc7-4914-9a3d-bb0aaaaaa170]
module.keycloak_prod.module.onestopauth.module.client_april-17-test-595.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bc941fdc-36c6-41ca-a31f-0d5317066c0a]
module.keycloak_prod.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab5e7aaa-acf0-4467-a5b3-c007f14030e3]
module.keycloak_prod.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c64340e5-4f11-4905-8749-5e111f05c51b]
module.keycloak_prod.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2fe798e0-4e96-47bf-8ce1-639b18301be5]
module.keycloak_prod.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e600489b-5444-41bc-b0de-f0b62aa3e250]
module.keycloak_prod.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fbdb4699-269d-46e0-8f91-b391b892dce0]
module.keycloak_prod.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=acd0f38f-e410-4a3f-a1ba-730cd43dddec]
module.keycloak_prod.module.onestopauth.module.client_august-17-4-pm-2-600.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=82c9c236-0650-4391-8d13-8ccde1644a93]
module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fc12dc4a-a4e0-4eaa-8d26-1e7629808b4a]
module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b6c25ba2-85d2-4397-89f5-8b3c898660b1]
module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e1445dff-2f08-4a3a-9dc5-cc953bb6b9e4]
module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=03aeba26-e07f-4e38-9f66-5b272e326a92]
module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=06f9af24-f97e-4f2a-aa92-fb97eede612d]
module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b781fcb6-2d50-4f7a-bd32-28b4051f810c]
module.keycloak_prod.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e99d3d2b-2d0b-4193-bca2-8cc6c12c6da1]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dbc177a4-8e42-4161-a701-9af55738d0c1]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=397a371a-c3bc-4ef8-9d20-18414214e53e]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b2f395d9-c4dc-4af8-a9dc-a034eff0399b]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d9344419-c5ef-48b6-8127-d8bac4b52dac]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=811301f7-6066-49a4-af86-000e2a0635b6]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4d8b0ab9-6735-4909-b42e-495a6735d79e]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ff88a994-be08-44df-b44e-32af353ea455]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d9de921f-2054-4a1b-b31a-d856e30904cf]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e05a4562-037d-485d-9330-ccafb395ccd4]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0791fab7-a968-4a2e-beb6-3e26a7076af4]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8b809df1-d101-4ec5-a51a-d6a7d316f1a3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2491e226-7bee-491e-8fb9-f431a07a762e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3c98e029-5dc2-4536-8a1d-49a15749771e]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2e3114c5-bc10-4469-ad05-2fa1834de165]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1afa4a96-3b43-42c3-9df5-c574d6cfc21f]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d74df522-b36e-4221-8e7c-c63e6f46671c]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c4207cb-0a3d-4020-a651-e133874981ab]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9051c3a7-50fa-4803-8901-861309971cee]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4e884a7c-bf32-4700-aa5a-92f89bab869e]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c3e09524-133d-4618-aecd-ffc65edcc46e]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e8521809-80cd-495c-86ea-1903728f602a]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8971e002-cf5a-48ce-ba90-c7cde263d762]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1fcfe422-3e1d-4485-84d4-69c58b366852]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8401602-f3aa-45e4-b092-bfb7601ff2d4]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dd00c54f-d028-484a-ab89-06083e4a949f]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=abb77d0e-62b6-4373-b7b5-00572c676309]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a7f0d4e5-9beb-4dbd-95fe-5764e81dd983]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=794b1719-832a-45a8-9781-2020bc1331a2]
module.keycloak_prod.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6cc4ae0f-1a17-4500-a97f-796fcbfe606e]
module.keycloak_prod.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5365e263-8fc1-486a-b1dc-8c87929ab982]
module.keycloak_prod.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=12014aa9-aa6d-4b45-8dd0-a04fb049d697]
module.keycloak_prod.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=380538f8-7854-4d10-9db6-222413404522]
module.keycloak_prod.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=505bd45a-facb-4f73-9f30-86d6c650ee91]
module.keycloak_prod.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3fef56ca-cb51-4cea-8ee0-cfbb392aa077]
module.keycloak_prod.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=55b7ca57-2191-4785-bf03-de633abd42ee]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=63aea95f-428e-4a42-a6a4-7498a75c3769]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f18f2297-83c5-4506-9e26-46efe0112060]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=41b9445b-3741-4b2d-87e8-c0f90eb0192b]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d44c502b-43e8-409a-882d-54207002ed57]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=50f0aeaa-066a-4088-92a3-2802f4927808]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=357064d1-2d0a-45af-a541-63e267bec570]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9e0d6885-983c-49b8-98da-8ffb17ce74ac]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3a996ce2-2356-4646-bbe2-48420ae30757]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3686f5f7-51dc-4d9e-a109-2e39d03e34a6]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=adda8927-9684-4af1-ad5b-6ae29e01fb04]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5258abeb-ce1b-4e0f-8734-7f291616c453]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7b6d9876-f1df-4c5f-89a2-8735ceb8a2c9]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdf4062e-f9f7-43d0-8285-9067d08d16d1]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=aeb2982e-7a95-40ce-9b35-71f53df99017]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f29c6f71-887b-4048-8829-8aa80059eb6d]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=50689c5e-4522-4583-b399-ea5f063c1268]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aeccfcd1-d924-4d31-b5ed-649acd3929a9]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=00b047a4-e3b6-48fa-9b3a-6f92fa7abf7b]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d2b6b056-1120-4d30-8f53-175e4b5958a1]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cc33563b-751a-42bb-bc1e-6447b07d46e3]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=77f00a1d-7096-4874-b731-f1bf6a2fb2d6]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d83711fc-4898-431a-abef-f42bdafae807]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3c77813e-ea25-4f8d-a414-5f63f856ed9f]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=746eb713-ab30-4974-b7a7-eb0d3d0c856b]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=784cb05b-c230-4fd8-96e2-dab84b0956a8]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8ae279b7-44a4-4cc6-bc29-da303eb14ff3]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f79b9d8b-0ddb-4773-b0d7-eea40f3e9fd7]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0c24fe36-cf7d-4789-bec8-484065f5265e]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1f9807e3-92d6-45b5-944d-85fbd4723bcc]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5d7c157f-0ad8-4b50-83ab-b9ea5a9e9ba7]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c0d963ec-3ee4-48c8-b229-4c9d935cdbe3]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=60f5ccb2-08dd-4ce2-8647-a4f2204455dd]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6f4cd7b0-23a2-4d50-924d-5732b5e31198]
module.keycloak_prod.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fd79ab7-7443-4bb0-9f00-82357f01931d]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c40ba8ac-cbab-4622-a68b-d3273a454ec2]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3989dbda-821a-4bd9-9ce8-0fe9bfce0a46]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=aad1dca1-d021-4d82-9f4f-4684f0699ba8]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f5469356-f387-45fc-8400-19b035bfedda]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b5fb3bbb-d6a6-4465-a82d-efee377517b0]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=21536bfa-a1b1-4d4d-9575-83e810737150]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=215df007-f631-4bdd-b1e8-0cb1d73dfa9e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=72dde44e-3848-4f19-a129-0f0b1ceddcc3]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=79a42b03-858c-4a2d-9e58-76aafd24a876]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b707f0e9-1c6b-4c26-8e8a-4462e26b12e7]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6c00155c-e8df-49e4-a492-a96d8fae2f38]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a04a35f0-8066-42d5-ab4b-a12b78133499]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=49b948f6-0e15-411c-85a3-2f74d09ec9ca]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5bc2c783-550e-44e4-aabc-6834a4fe7ad2]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b659c2f9-1694-410f-91d2-15407bfc07fc]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2200ba37-e18a-4327-a93e-a7a5c7e195ed]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=94584fda-f865-482d-9b72-6969ecd76acb]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b9218215-3afd-42c7-ba80-38a52015a42b]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2a629154-d786-4aab-84ac-fb7dee00c545]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7e733e27-8199-459f-89ec-89a0dd235bcb]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8e42bfda-6ba9-4557-acd8-a6f9410297a3]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6282f1b9-e1a3-4944-a309-71bc7506e4b2]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aa1c58fe-b390-45a2-8b80-8a547f5e1ac1]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb2929ff-738b-407e-8717-c13cdb5d6df4]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ef729f29-c171-4a24-b577-9afcf1698904]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=af8edbe9-cd7e-45bb-a277-0047cef330a1]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ca7dec40-8a3d-4d12-8778-2e5ee1d2da31]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=04f15480-a480-4521-9ee4-b6b45e300d29]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bb842704-baee-4dc5-a51b-40efbf25b406]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7f44ef42-a9d1-409c-9ce0-168d680956ca]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cdef4b98-07dd-454e-bd35-716c44053717]
module.keycloak_prod.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c3fa2795-9f5f-4084-895b-37f33cc4fa29]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4d0086b5-0c2d-43fc-9dc3-3df68f97dced]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1857a679-9e33-4fc9-8900-3e1637d5fee8]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=882853bb-bf48-4698-b2bb-103fda3748ec]
module.keycloak_prod.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=088bdc48-eee4-4f73-bf61-125c587a0222]
module.keycloak_prod.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f2b68cb6-88b4-4b04-be5d-392d86d97a44]
module.keycloak_prod.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=22c317ed-a672-46bd-81cd-9e9230439b28]
module.keycloak_prod.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5fe316b2-0865-458b-955f-e70356cd0a9d]
module.keycloak_prod.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e87748bf-2374-4867-a72f-dea9acd4390a]
module.keycloak_prod.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=80a97ca3-681a-4a1f-ab2a-5a3b9bfe587b]
module.keycloak_prod.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e7404a37-58d8-4ccd-b325-6ebe771b6fdb]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f85d2179-5d76-4bf2-b8a2-03765cc19d75]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=427186bb-b6f7-48e8-ba04-6a46b120a7d6]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f70b3b01-c291-4174-ba58-3144211642e1]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f19962a8-7572-4ce9-ad28-0a3643588c53]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9425db28-1d87-4f78-bb8d-e130fd212637]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e935485-4cf1-460f-b611-fa0147701fe9]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c9d0930c-f6ce-47f8-9a40-1d45f77b9c89]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6bcc43f9-4b48-4211-b5d0-4f88864fc33f]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=569a6aa0-81eb-4b45-8c6d-1b4aaa86ee6f]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7cd7e36c-d2b6-4788-9452-334193ed8871]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c0ed030e-212e-4205-8c98-99379ef0de0d]
module.keycloak_prod.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4a47c2a3-b803-4870-9d2b-6e1e01d496d4]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6e62d39c-ec8d-4706-88bd-8aa7507d3924]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=08454973-aece-41fd-bd2b-4eeaa42191a7]
module.keycloak_prod.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6a818005-cde4-4dae-9c55-1208bde9010c]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ac281a9e-ec7b-43d5-872b-3489e83d35b1]
module.keycloak_prod.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5f9b49bd-2839-42da-850a-cf7de0c44bab]
module.keycloak_prod.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b505ce05-4639-49c9-a1d8-abe7f6d866e7]
module.keycloak_prod.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bca9c4f7-0280-425c-810d-de550dc9a111]
module.keycloak_prod.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8059ec83-21ac-4db6-8ccb-be6c805ac50a]
module.keycloak_prod.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=23203d7f-2e49-4c29-914f-251b8f5a6749]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d122ce84-57a4-4707-bfbf-2e0fd92d676e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-3037"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-3037"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-3037"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-3037"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-3037"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-3037"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-3037"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-3037"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2904 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*